# RbsLoadSubClassificationMotor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsLoadSubClassificationMotor Property
ParameterTypeId Class See Also
---
"Load Sub-Classification Motor"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsLoadSubClassificationMotor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsLoadSubClassificationMotor As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsLoadSubClassificationMotor {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace